Ran Plan for dir: `webserver-cluster` workspace: `default`

<details><summary>Show Output</summary>

```diff
Acquiring state lock. This may take a few moments...
aws_security_group.instance: Refreshing state... [id=sg-0d453e027dff9c18c]
aws_security_group.alb: Refreshing state... [id=sg-0067946aec61526d9]
aws_launch_configuration.example: Refreshing state... [id=terraform-20210113012228874300000001]
aws_lb_target_group.asg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:869946923544:targetgroup/terraform-asg-example/cb6c5ac9d05a7d15]
aws_lb.example: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:869946923544:loadbalancer/app/terraform-asg-example/d27b91495bc2cf9b]
aws_autoscaling_group.example: Refreshing state... [id=tf-asg-20210112153655884200000002]
aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:869946923544:listener/app/terraform-asg-example/d27b91495bc2cf9b/40056f14894f5c7f]
aws_lb_listener_rule.asg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:869946923544:listener-rule/app/terraform-asg-example/d27b91495bc2cf9b/40056f14894f5c7f/d45c67d4097a32f1]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
~ update in-place
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_group.example will be updated in-place
~ resource "aws_autoscaling_group" "example" {
        id                        = "tf-asg-20210112153655884200000002"
      ~ launch_configuration      = "terraform-20210112153654625400000001" -> "terraform-20210113012228874300000001"
        name                      = "tf-asg-20210112153655884200000002"
      ~ target_group_arns         = [
          - "arn:aws:elasticloadbalancing:us-east-2:869946923544:targetgroup/terraform-asg-example/cb6c5ac9d05a7d15",
        ] -> (known after apply)
        # (20 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_launch_configuration.example (deposed object 1585044d) will be destroyed
- resource "aws_launch_configuration" "example" {
      - arn                              = "arn:aws:autoscaling:us-east-2:869946923544:launchConfiguration:6d62d5af-2976-48e9-a872-23fe735e3c09:launchConfigurationName/terraform-20210112153654625400000001" -> null
      - associate_public_ip_address      = false -> null
      - ebs_optimized                    = false -> null
      - enable_monitoring                = true -> null
      - id                               = "terraform-20210112153654625400000001" -> null
      - image_id                         = "ami-0c55b159cbfafe1f0" -> null
      - instance_type                    = "t2.micro" -> null
      - name                             = "terraform-20210112153654625400000001" -> null
      - security_groups                  = [
          - "sg-0d453e027dff9c18c",
        ] -> null
      - user_data                        = "b28728ee47dd3e96016b1d23e4e6baf7343bf128" -> null
      - vpc_classic_link_security_groups = [] -> null
    }

  # aws_lb_listener_rule.asg will be updated in-place
~ resource "aws_lb_listener_rule" "asg" {
        id           = "arn:aws:elasticloadbalancing:us-east-2:869946923544:listener-rule/app/terraform-asg-example/d27b91495bc2cf9b/40056f14894f5c7f/d45c67d4097a32f1"
        # (3 unchanged attributes hidden)

      ~ action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:869946923544:targetgroup/terraform-asg-example/cb6c5ac9d05a7d15" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_target_group.asg must be replaced
-/+ resource "aws_lb_target_group" "asg" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-2:869946923544:targetgroup/terraform-asg-example/cb6c5ac9d05a7d15" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/terraform-asg-example/cb6c5ac9d05a7d15" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-2:869946923544:targetgroup/terraform-asg-example/cb6c5ac9d05a7d15" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
        name                               = "terraform-asg-example"
      ~ port                               = 9090 -> 4000 # forces replacement
      - tags                               = {} -> null
        # (7 unchanged attributes hidden)


      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 2 to destroy.
Releasing state lock. This may take a few moments...

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d webserver-cluster`
* :put_litter_in_its_place: To **delete** this plan click [here](https://ef1ed0cb3538.ngrok.io/lock?id=jonico%252Fatlantis-example%252Fwebserver-cluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d webserver-cluster`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
